# FabricationSaveJobOptions Class

---
Options for FabricationPart.SaveAsFabricationJob() method.
SystemObject Autodesk.Revit.DB.FabricationFabricationSaveJobOptions
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class FabricationSaveJobOptions : IDisposable

    Public Class FabricationSaveJobOptions
    	Implements IDisposable

    public ref class FabricationSaveJobOptions : IDisposable

    type FabricationSaveJobOptions =
        class
            interface IDisposable
        end
The FabricationSaveJobOptions type exposes the following members.
| Name| Description
---|---|---
| FabricationSaveJobOptions|  Default Constructor
| FabricationSaveJobOptions(Boolean)|  Constructor
Top
| Name| Description
---|---|---
| AddHolesForTaps|  Set true to have holes for taps on straights added to the created fabrication job.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the FabricationSaveJobOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Fabrication Namespace